RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_can.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else if(NOT_VALID_POINTER(rx_fifo)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        rx_fifo_addr = (uint32_t *)rx_fifo;
        can_mb = CAN_RAM(can_periph);
        /* read FIFO descriptor 0 */
        *rx_fifo_addr = *((uint32_t *)can_mb );
        rx_fifo->id = *((uint32_t *)((uint32_t)(can_mb + 0x04U)));
        rx_fifo->data[0] = *((uint32_t *)((uint32_t)(can_mb + 0x08U)));
        rx_fifo->data[1] = *((uint32_t *)((uint32_t)(can_mb + 0x0CU)));

        /* clear FIFO status */
        CAN_STAT(can_periph) = CAN_STAT_MS5_RFNE;

        /* read FIFO id field */
        if(rx_fifo->ide) {
            rx_fifo->id = GET_FDES1_ID_EXD(rx_fifo->id);
        } else {
            rx_fifo->id = GET_FDES1_ID_STD(rx_fifo->id);
        }
        /* read FIFO data */
        can_data_to_little_endian_swap(rx_fifo->data, rx_fifo->data, rx_fifo->dlc);
    }
}

/*!
    \brief      get rx FIFO filter matching number (API_ID:0x0013U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     filter number
*/
uint32_t can_rx_fifo_filter_matching_number_get(uint32_t can_periph)
{
    uint32_t ret = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ret = GET_RFIFOIFMN_IDFMN(CAN_RFIFOIFMN(can_periph));
    }
    return ret;
}

/*!
    \brief      clear rx FIFO (API_ID:0x0014U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_rx_fifo_clear(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_STAT(can_periph) = CAN_STAT_MS0_RFC;
    }
}

/*!
    \brief      get mailbox RAM address (API_ID:0x0015U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index, 0-31
    \param[out] none
    \retval     pointer to the mailbox address
*/
uint32_t can_ram_address_get(uint32_t can_periph, uint32_t index)
{
    uint32_t payload_size;
    uint32_t address = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else if(NOT_CAN_MAILBOX_INDEX(index)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0015U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* if CAN FD mode is enabled */
        if(CAN_CTL0(can_periph) & CAN_CTL0_FDEN) {
            payload_size = (uint32_t)1U << (GET_FDCTL_MDSZ(CAN_FDCTL(can_periph)) + 3U);
        } else {
            payload_size = 8U;
        }
        address = (uint32_t)(CAN_RAM(can_periph) + (payload_size + 8U) * index);
    }

    return address;
}

/*!
    \brief      configure mailbox (API_ID:0x0016U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[in]  mdpara: mailbox descriptor struct
                  rtr: 0, 1
                  ide: 0, 1
                  id: 0 - 0x1FFFFFFF
                  code: CAN_MB_RX_STATUS_INACTIVE, CAN_MB_RX_STATUS_FULL, CAN_MB_RX_STATUS_EMPTY,
                        CAN_MB_RX_STATUS_OVERRUN, CAN_MB_RX_STATUS_RANSWER, CAN_MB_RX_STATUS_BUSY,
                        CAN_MB_TX_STATUS_INACTIVE, CAN_MB_TX_STATUS_ABORT, CAN_MB_TX_STATUS_DATA
                  data_bytes: 0 - 64
                  data: point to the data
                  esi: 0, 1
                  fdf: 0, 1
                  brs: 0, 1
                  prio: 0 - 7
    \param[out] none
    \retval     none
*/
void can_mailbox_config(uint32_t can_periph, uint32_t index, can_mailbox_descriptor_struct *mdpara)
{
    uint32_t dlc;
    uint32_t mdes0 = 0U;
    uint32_t mdes1;
    uint32_t mdes2;
    uint32_t mdes3;
    uint32_t length;
    uint32_t mdes;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else if(NOT_CAN_MAILBOX_INDEX(index)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0016U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(mdpara)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0016U), ERR_PARAM_POINTER);
    } else if(NOT_CAN_MDES0_CODE(mdpara->code)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0016U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(mdpara->data)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0016U), ERR_PARAM_POINTER);
    } else if(NOT_CAN_DATA_BYTES(mdpara->data_bytes)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0016U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_CAN_ID(mdpara->ide, mdpara->id)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0016U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear mailbox status */
        CAN_STAT(can_periph) = STAT_MS(index);

        /* get mailbox base address */
        mdes = can_ram_address_get(can_periph, index);
        mdes1 = mdes + 0x04U;
        mdes2 = mdes + 0x08U;
        mdes3 = mdes + 0x0CU;
        *(uint32_t *)mdes = 0U;
        *(uint32_t *)mdes1 = 0U;
        *(uint32_t *)mdes2 = 0U;
        *(uint32_t *)mdes3 = 0U;
        /* set RTR bit */
        if(mdpara->rtr) {
            mdes0 |= CAN_MDES0_RTR;
        }

        /* set IDE bit and ID field */
        if(mdpara->ide) {
            mdes0 |= CAN_MDES0_IDE;
            mdes0 |= CAN_MDES0_SRR;
            *(uint32_t *)mdes1 |= MDES1_ID_EXD(mdpara->id);
        } else {
            *(uint32_t *)mdes1 |= MDES1_ID_STD(mdpara->id);
        }

        /* set CODE field */
        mdes0 |= MDES0_CODE(mdpara->code);

        if(mdpara->code != CAN_MB_RX_STATUS_EMPTY) {
            /* copy user's buffer into the mailbox data area */
            if(mdpara->data_bytes) {
                dlc = can_dlc_value_compute(mdpara->data_bytes);
                mdes0 |= MDES0_DLC(dlc);
                length = (uint32_t)1U << (GET_FDCTL_MDSZ(CAN_FDCTL(can_periph)) + 3U);
                if(mdpara->data_bytes < length) {
                    length = mdpara->data_bytes;
                }
                can_data_to_big_endian_swap((uint32_t *)mdes2, (uint32_t *)mdpara->data, length);
            }

            /* prepare mailbox for transmission */
            if(CAN_MB_TX_STATUS_DATA == mdpara->code) {
                /* set ESI bit */
                if(mdpara->esi) {
                    mdes0 |= CAN_MDES0_ESI;
                }
                /* set FDF and BRS bit */
                if(mdpara->fdf) {
                    mdes0 |= CAN_MDES0_FDF;
                    if(mdpara->brs) {
                        mdes0 |= CAN_MDES0_BRS;
                    }
                    mdes0 &= ~CAN_MDES0_RTR;
                }
            }

            /* set PRIO field */
            *(uint32_t *)mdes1 |= MDES1_PRIO(mdpara->prio);
        }

        /* set mailbox descriptor 0 */
       *(uint32_t *)mdes = mdes0;
    }
}

/*!
    \brief      abort mailbox transmit (API_ID:0x0017U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_mailbox_transmit_abort(uint32_t can_periph, uint32_t index)
{
    uint32_t mdes0;
    uint32_t mdes;

