RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_can.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = CAN_PN_STAT(can_periph);
        if(0U != (reg & CAN_PN_STAT_MMCNTS)) {
            ret = (int32_t)(uint32_t)GET_PN_STAT_MMCNT(reg);
        } else {
            ret = -1;
        }
    }
    return ret;
}

/*!
    \brief      get matching message (API_ID:0x0025U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: Pretended Networking mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] mdpara: wakeup message information
    \retval     none
*/
void can_pn_mode_data_read(uint32_t can_periph, uint32_t index, can_mailbox_descriptor_struct *mdpara)
{
    uint32_t *mdaddr;
    uint32_t pnram;
    uint32_t pnram1 = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else if(NOT_CAN_PN_MB_INDEX(index)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0025U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(mdpara)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0025U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        mdaddr = (uint32_t *)mdpara;
        pnram = (uint32_t)(CAN_PN_RAM(can_periph) + index * 16U);
        *mdaddr = *(uint32_t *)pnram;
        pnram1 = *(uint32_t *)((uint32_t)(pnram + 0x04U));
        mdpara->id = (pnram1 & 0x1FFFFFFFU);
        mdpara->prio = (pnram1 & 0xE0000000U) >> 29U;
        /* get mailbox ID */
        if(0U != mdpara->ide) {
            mdpara->id = GET_MDES1_ID_EXD(mdpara->id);
        } else {
            mdpara->id = GET_MDES1_ID_STD(mdpara->id);
        }
        mdpara->data_bytes = mdpara->dlc;
        /* remote frame */
        if(0U != ((*mdaddr) & CAN_PN_RWMXCS_RRTR)){
            mdpara->data_bytes = 0U;
        }else{
            /* classical frame */
            if(mdpara->dlc <= 8U) {
                mdpara->data_bytes = mdpara->dlc;
            }else{
                mdpara->data_bytes = 8U;
            }
        }
        if(mdpara->data_bytes) {
            can_data_to_little_endian_swap((uint32_t *)mdpara->data, (uint32_t *)((uint32_t)(pnram + 0x08U)), mdpara->data_bytes);
        }
    }
}

/*!
    \brief      enable self reception (API_ID:0x0026U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_self_reception_enable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL0(can_periph) &= ~CAN_CTL0_SRDIS;
    }
}

/*!
    \brief      disable self reception (API_ID:0x0027U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_self_reception_disable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL0(can_periph) |= CAN_CTL0_SRDIS;
    }
}

/*!
    \brief      enable transmit abort (API_ID:0x0028U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_transmit_abort_enable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL0(can_periph) |= CAN_CTL0_MST;
    }
}

/*!
    \brief      disable transmit abort (API_ID:0x0029U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_transmit_abort_disable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL0(can_periph) &= ~CAN_CTL0_MST;
    }
}

/*!
    \brief      enable auto bus off recovery mode (API_ID:0x002AU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_auto_busoff_recovery_enable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL1(can_periph) &= ~CAN_CTL1_ABORDIS;
    }
}

/*!
    \brief      disable auto bus off recovery mode (API_ID:0x002BU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_auto_busoff_recovery_disable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL1(can_periph) |= CAN_CTL1_ABORDIS;
    }
}

/*!
    \brief      enable time sync mode (API_ID:0x002CU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_time_sync_enable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL1(can_periph) |= CAN_CTL1_TSYNC;
    }
}

/*!
    \brief      disable time sync mode (API_ID:0x002DU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_time_sync_disable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL1(can_periph) &= ~CAN_CTL1_TSYNC;
    }
}

/*!
    \brief      enable edge filter mode (API_ID:0x002EU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_edge_filter_mode_enable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL2(can_periph) &= ~CAN_CTL2_EFDIS;
    }
}

/*!
    \brief      disable edge filter mode (API_ID:0x002FU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_edge_filter_mode_disable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL2(can_periph) |= CAN_CTL2_EFDIS;
    }
}

/*!
    \brief      enable protocol exception detection mode (API_ID:0x0030U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_ped_mode_enable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL2(can_periph) |= CAN_CTL2_PREEN;
    }
}

/*!
    \brief      disable protocol exception detection mode (API_ID:0x0031U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_ped_mode_disable(uint32_t can_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL2(can_periph) &= ~CAN_CTL2_PREEN;
    }
}

/*!
    \brief      configure arbitration delay bits (API_ID:0x0032U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  delay_bits: delay bits
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_arbitration_delay_bits_config(uint32_t can_periph, uint32_t delay_bits)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else if(NOT_CAN_DELAY_BITS(delay_bits)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0032U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_CTL2(can_periph) &= ~CAN_CTL2_ASD;
        CAN_CTL2(can_periph) |= (uint32_t)CTL2_ASD(delay_bits);
    }
}

/*!
    \brief      configure bit sampling mode (API_ID:0x0033U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  sampling_mode: bit sampling mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_BSP_MODE_ONE_SAMPLE: one sample for received bit
      \arg        CAN_BSP_MODE_THREE_SAMPLES: three samples for received bit
    \param[out] none
    \retval     none
*/
void can_bsp_mode_config(uint32_t can_periph, uint32_t sampling_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CAN_PERIPH(can_periph)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else if(NOT_CAN_BSP_MODE(sampling_mode)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0033U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CAN_BSP_MODE_ONE_SAMPLE == sampling_mode) {
            CAN_CTL1(can_periph) &= ~CAN_CTL1_BSPMOD;
        } else {
            CAN_CTL1(can_periph) |= CAN_CTL1_BSPMOD;
        }
    }
}

/*!
    \brief      get CAN flag (API_ID:0x0034U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  flag: CAN flags, refer to can_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        CAN_FLAG_CAN_PN: Pretended Networking state flag
      \arg        CAN_FLAG_SOFT_RST: software reset flag
      \arg        CAN_FLAG_ERR_SUMMARY: error summary flag
      \arg        CAN_FLAG_BUSOFF: bus off flag
      \arg        CAN_FLAG_RECEIVING: receiving state flag
      \arg        CAN_FLAG_TRANSMITTING: transmitting state flag
      \arg        CAN_FLAG_IDLE: IDLE state flag
      \arg        CAN_FLAG_RX_WARNING: receive warning flag
      \arg        CAN_FLAG_TX_WARNING: transmit warning flag
      \arg        CAN_FLAG_STUFF_ERR: stuff error flag
      \arg        CAN_FLAG_FORM_ERR: form error flag
      \arg        CAN_FLAG_CRC_ERR: CRC error flag
      \arg        CAN_FLAG_ACK_ERR: ACK error flag
      \arg        CAN_FLAG_BIT_DOMINANT_ERR: bit dominant error flag
      \arg        CAN_FLAG_BIT_RECESSIVE_ERR: bit recessive error flag
      \arg        CAN_FLAG_SYNC_ERR: synchronization flag
      \arg        CAN_FLAG_BUSOFF_RECOVERY: bus off recovery flag
      \arg        CAN_FLAG_ERR_SUMMARY_FD: fd error summary flag
      \arg        CAN_FLAG_ERR_OVERRUN: error overrun flag
      \arg        CAN_FLAG_STUFF_ERR_FD: stuff error in FD data phase flag
      \arg        CAN_FLAG_FORM_ERR_FD: form error in FD data phase flag
      \arg        CAN_FLAG_CRC_ERR_FD: CRC error in FD data phase flag
      \arg        CAN_FLAG_BIT_DOMINANT_ERR_FD: bit dominant error in FD data phase flag
      \arg        CAN_FLAG_BIT_RECESSIVE_ERR_FD: bit recessive error in FD data phase flag
      \arg        CAN_FLAG_MBx(x=0~31): mailbox x flag
      \arg        CAN_FLAG_FIFO_AVAILABLE: fifo available flag
      \arg        CAN_FLAG_FIFO_WARNING: fifo warning flag
      \arg        CAN_FLAG_FIFO_OVERFLOW: fifo overflow flag
      \arg        CAN_FLAG_WAKEUP_MATCH: Pretended Networking match flag
      \arg        CAN_FLAG_WAKEUP_TIMEOUT: Pretended Networking timeout wakeup flag
      \arg        CAN_FLAG_TDC_OUT_OF_RANGE: transmitter delay is out of compensation range flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus can_flag_get(uint32_t can_periph, can_flag_enum flag)
{
    FlagStatus status = RESET;

